#Область СлужебныеПроцедурыИФункции

Процедура ОправитьСообщение() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВКМ_ОтправкаСообщений);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК Текст
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";

	РезультатЗапроса = Запрос.Выполнить();
	НовыеСообщения = РезультатЗапроса.Выгрузить();
	Сообщения = НовыеСообщения.ВыгрузитьКолонку(0);

	УдаленныеСообщения = Новый Массив;
	Для Каждого Текст Из Сообщения Цикл
		Попытка
//			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
			Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
			ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
			Если ПустаяСтрока(Токен) Или ПустаяСтрока(ИдентификаторГруппы) Тогда
				ЗаписьЖурналаРегистрации(
            	"Телеграм", УровеньЖурналаРегистрации.Ошибка, , , "Не задан токен или ChatID в константах");

			КонецЕсли;

			Ресурс = "bot" + Токен + "/sendMessage";
			Соединение = Новый HTTPСоединение("api.telegram.org", 443, "", "", 30, Новый ЗащищенноеСоединениеOpenSSL);
			Запрос = Новый HTTPЗапрос(Ресурс);
			Запрос.Заголовки.Вставить("Content-Type", "application/json");

			Данные = Новый Структура;
			Данные.Вставить("chat_id", ИдентификаторГруппы);
			Данные.Вставить("text", Текст);

			Запись = Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			ЗаписатьJSON(Запись, Данные);
			СтрокаJSON = Запись.Закрыть();

			Запрос.УстановитьТелоИзСтроки(СтрокаJSON);

			Ответ = Соединение.ОтправитьДляОбработки("POST", Запрос);

			УдаленныеСообщения.Добавить(Текст);

			Если Ответ.КодСостояния <> 200 Тогда
				ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
				ЗаписьЖурналаРегистрации(
                "Телеграм", УровеньЖурналаРегистрации.Ошибка, , , "Код " + Ответ.КодСостояния + ": " + ТекстОшибки);
			КонецЕсли;

		Исключение
			ЗаписьЖурналаРегистрации(
            "Телеграм", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());

		КонецПопытки;
	КонецЦикла;
	УдалитьОтправленныеСообщения();
КонецПроцедуры

Процедура УдалитьОтправленныеСообщения()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
		

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элемент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Элемент.Удалить();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти