#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");

КонецПроцедуры


//ВКМ_Отключить проверку заполнения основания для абонентко платы 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Основание"));
	КонецЕсли;

КонецПроцедуры

//ВКМ_Отключить проверку заполнения основания для абонентко платы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗаказПокупателя.Организация КАК Организация,
				   |	ЗаказПокупателя.Контрагент КАК Контрагент,
				   |	ЗаказПокупателя.Договор КАК Договор,
				   |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
				   |	ЗаказПокупателя.Товары.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Товары,
				   |	ЗаказПокупателя.Услуги.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Услуги
				   |ИЗ
				   |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				   |ГДЕ
				   |	ЗаказПокупателя.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;

	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;

	Основание = ДанныеЗаполнения;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
//ВКМ Заполнение выставленной суммы по номенклатуре работа специалиста 	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугУслуги.Номенклатура = &Номенклатура";

	Запрос.УстановитьПараметр("Номенклатура", Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.ВыставленнаяСуммаКОплате = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;


//ВКМ Заполнение выставленной суммы по номенклатуре работа специалиста 	

КонецПроцедуры

//ВКМ__Заполнение документа для абоненсткой платы
Процедура ВыполнитьАвтозаполнение() Экспорт

	НоменклатураАбоненткаяПлата = Константы.ВКМ_НоменклатураАбоненсткаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Ошибки = Неопределено;
	Если Не ЗначениеЗаполнено(НоменклатураАбоненткаяПлата) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Не заполнена номенклатура абоненсткая плата");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ,
			"Не заполнена номенклатура работы специалиста");

	КонецЕсли;

	Если Ошибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Истина);
		Возврат;
	Иначе
		ДокументОбъект = Ссылка.ПолучитьОбъект();

		ДокументОбъект.Услуги.Очистить();

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Договор.ВКМ_СуммаАбоненсткойПлаты КАК СуммаАбоненсткойПлаты
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Если Выборка.СуммаАбоненсткойПлаты <> 0 Тогда
				НоваяУслуга = ДокументОбъект.Услуги.Добавить();
				НоваяУслуга.Номенклатура = НоменклатураАбоненткаяПлата;
				НоваяУслуга.Сумма = Выборка.СуммаАбоненсткойПлаты;
			КонецЕсли;

		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, Месяц) КАК НачалоМесяца,
		|	РеализацияТоваровУслуг.Договор,
		|	КОНЕЦПЕРИОДА(РеализацияТоваровУслуг.Дата, Месяц) КАК КонецМесяца
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботы.Период,
		|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор,
		|	ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате КАК СуммаКОплате,
		|	ВТ_Док.НачалоМесяца КАК НачалоМесяца,
		|	ВТ_Док.КонецМесяца,
		|	ВТ_Док.Договор,
		|	ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
		|		ПО ВКМ_ВыполненныеКлиентуРаботы.Договор = ВТ_Док.Договор
		|ГДЕ
		|	ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ ВТ_Док.НачалоМесяца И ВТ_Док.КонецМесяца
		|ИТОГИ
		|	СУММА(СуммаКОплате) КАК СуммаКОплате,
		|	СУММА(КоличествоЧасов)
		|ПО
		|	Договор";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НоваяУслуга = ДокументОбъект.Услуги.Добавить();
			НоваяУслуга.Номенклатура = НоменклатураРаботыСпециалиста;
			НоваяУслуга.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
			НоваяУслуга.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасов;
		КонецЕсли;

		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

	КонецЕсли;

КонецПроцедуры	
//ВКМ__Заполнение документа для абоненсткой платы
#КонецОбласти

#КонецЕсли