#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	Записать();
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыФормы = АнализГрафикаНаСервере();
	Закрыть();
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	СУММА(РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, СЕКУНДА, -1),
	|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ)) КАК ДнейОтпуска
	|ПОМЕСТИТЬ Отпуска
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
	|ИЗ
	|	Отпуска КАК Отпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|		ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = Отпуска.Сотрудник
	|ГДЕ
	|	Отпуска.ДнейОтпуска > 28
	|	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.Закрашивать = Ложь;
	КонецЦикла;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
			Если Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник Тогда
				Строка.Закрашивать = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	ТаблицаДляАнализа = Объект.ОтпускаСотрудников.Выгрузить();
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаДляАнализа, УникальныйИдентификатор);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	ПараметрыФормы.Вставить("Ключ", Объект.Ссылка);

	Возврат ПараметрыФормы;

КонецФункции

#КонецОбласти