#Область СлужебныеПроцедурыИФункции
Функция ДоговорРеализацияДлительныеОперации(Период, Пользователь) Экспорт
    ДоговорРеализация = Новый Соответствие;
	Договоры = Новый Массив;

	ЗапросДоговор = Новый Запрос;
	ЗапросДоговор.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И (&НачалоПериода МЕЖДУ ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора
	|	И Месяц(ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора) >= Месяц(&КонецПериода))";
	
	ЗапросДоговор.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ЗапросДоговор.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ДоговорыАб = ЗапросДоговор.Выполнить().Выбрать();

	Пока ДоговорыАб.Следующий() Цикл
		Договоры.Добавить(ДоговорыАб.Договор);
		ДоговорРеализация.Вставить(ДоговорыАб.Договор, Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	КонецЦикла;

	ЗапросРеализация = Новый Запрос;
	ЗапросРеализация.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";

	ЗапросРеализация.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	ЗапросРеализация.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Реализации = ЗапросРеализация.Выполнить().Выбрать();
	
	Пока Реализации.Следующий() Цикл
		Для Каждого Дог Из Договоры Цикл
			Если Реализации.Реализация.Договор.Ссылка = Дог Тогда
				ДоговорРеализация[Дог] = Реализации.Реализация;
			Иначе
				Продолжить; 	 	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	МассивСсылок = Новый Массив;
	
	Для Каждого Договор Из ДоговорРеализация  Цикл
		Если Договор.Значение <> Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			МассивСсылок.Добавить(Договор.Значение);
		Иначе
			НоваяСсылка = СоздатьРеализациюПоДоговору(Договор.Ключ, Период, Пользователь);
			МассивСсылок.Добавить(НоваяСсылка);
			ДоговорРеализация.Вставить(Договор.Ключ, НоваяСсылка);	
		КонецЕсли;		
	КонецЦикла;	
	
	Прогресс = 0;
	Для Каждого Ссылка Из МассивСсылок Цикл
		Прогресс = Прогресс + 1;
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВыполнитьАвтозаполнение();
		ДокументОбъект.Прочитать();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ПроцентПрогресса = Прогресс * 100 / МассивСсылок.Количество(); 
		//@skip-check undefined-variable
		ДлительныеОперации.СообщитьПрогресс(ПроцентПрогресса, "Создаем реализации за указанный период");
	КонецЦикла;	
	
	Возврат ДоговорРеализация;
	
КонецФункции


Функция СоздатьРеализациюПоДоговору(Договор, Период, Пользователь);
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Дата = Период.ДатаОкончания;
	НовыйДокумент.Договор = Договор;
	НовыйДокумент.Контрагент = Договор.Владелец.Ссылка;
	НовыйДокумент.Организация = Договор.Организация.Ссылка;
	НовыйДокумент.Ответственный = Пользователь;
	НовыйДокумент.Записать();	
	
	Возврат НовыйДокумент.Ссылка;
Конецфункции

#КонецОбласти