#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Дата,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиентов.Ссылка
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора = &ВидДоговора
	|	И ВКМ_ОбслуживаниеКлиентов.Дата
	|		МЕЖДУ ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора
	|	И ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;

		Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы;
		КонецЦикла;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
				"Договор без абонентского обслуживания либо истек срок действия договора");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";

	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = Специалист;

		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы
			* ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("Сотруднику %1 не назначен процент премии от работ", Специалист));
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = "Оформлен новый заказ №" + ЭтотОбъект["Номер"];
		Уведомление.Записать();
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ПредыдущийСпециалист = ВыборкаДетальныеЗаписи.Специалист;
			ПредыдущаяДата = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
			ПредыдущееВремя = ВыборкаДетальныеЗаписи.ВремяНачалаРабот;
		КонецЕсли;

		Если ПредыдущийСпециалист <> Специалист Тогда
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = СтрШаблон("В заказе № %1 изменен специалист на %2", ЭтотОбъект["Номер"],
				Специалист);
			Уведомление.Записать();
		ИначеЕсли ПредыдущаяДата <> ДатаПроведенияРабот Тогда
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = СтрШаблон("В заказе № %1 изменена дата проведения работ на %2",
				ЭтотОбъект["Номер"], Формат(ДатаПроведенияРабот, "ДЛФ=DD;"));
			Уведомление.Записать();
		ИначеЕсли ПредыдущееВремя <> ВремяНачалаРабот Тогда
			Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			Уведомление.ТекстСообщения = СтрШаблон("В заказе № %1 изменено время начала работ на %2",
				ЭтотОбъект["Номер"], Формат(ВремяНачалаРабот, "ДЛФ=T"));
			Уведомление.Записать();
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#КонецЕсли