#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.АдресДанных <> Неопределено Тогда
		Таблица = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Данные об отпусках не получены");	
	КонецЕсли;	
	
	АнализГрафикаОтпусков.Обновление = Ложь;
	АнализГрафикаОтпусков.Очистить();
		
	ОтпускПлан = АнализГрафикаОтпусков.Серии.Добавить();
	ОтпускПлан.Текст = "План отпусков";
	
	Шкала = АнализГрафикаОтпусков.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала.Единица = ТипЕдиницыШкалыВремени.Год;
	Шкала.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	

	ПервыйЭлемент = АнализГрафикаОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 1);
	
	Элемент = АнализГрафикаОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	Элемент.Единица = ТипЕдиницыШкалыВремени.День;
	Элемент.Кратность = 1;
	Элемент.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;
	Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
	
	АнализГрафикаОтпусков.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
	АнализГрафикаОтпусков.КратностьПериодическогоВарианта = 1;
	АнализГрафикаОтпусков.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Год;
	
	Для Каждого Отпуск Из Таблица Цикл
		
		Точка = АнализГрафикаОтпусков.УстановитьТочку(Отпуск.Сотрудник);
		Точка.Текст = Отпуск.Сотрудник;
		
		Значение = АнализГрафикаОтпусков.ПолучитьЗначение(Точка, ОтпускПлан);
		Значение.Редактирование = Истина;

		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		
	КонецЦикла;
	
	АнализГрафикаОтпусков.Обновление = Истина;
	УдалитьИзВременногоХранилища(Параметры.АдресДанных);
	
	
КонецПроцедуры

#КонецОбласти

