#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Ослуживание" Тогда

		ОбновитьКалендарь();

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НачалоПериодаОтображения = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериодаОтображения = КонецНедели(ТекущаяДатаСеанса());
	Календарь.ТекущиеПериодыОтображения.Добавить(НачалоПериодаОтображения, КонецПериодаОтображения);

	ОбновитьКалендарь();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	ОбновитьКалендарь();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата", ОбщегоНазначенияКлиент.ДатаСеанса());
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначенияЗаполнения.Вставить("Специалист", Специалист);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);

	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.ФормаОбъекта", ПараметрыФормы);
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьКалендарь();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьКалендарь()

	Календарь.Элементы.Очистить();

	НачалоПериода = НачалоГода(ТекущаяДатаСеанса());
	КонецПериода = КонецГода(ТекущаяДатаСеанса());

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентов.Ссылка,
	|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот,
	|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот,
	|	ВКМ_ОбслуживаниеКлиентов.Клиент.Представление КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентов.Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &Начало И &Конец
	|	И ВКМ_ОбслуживаниеКлиентов.Специалист = &Специалист";

	Запрос.УстановитьПараметр("Начало", НачалоПериода);
	Запрос.УстановитьПараметр("Конец", КонецПериода);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НачалоРабот = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + (ВыборкаДетальныеЗаписи.ВремяНачалаРабот - НачалоДня(
			ВыборкаДетальныеЗаписи.ВремяНачалаРабот));
		ОкончаниеРабот = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + (ВыборкаДетальныеЗаписи.ВремяОкончанияРабот
			- НачалоДня(ВыборкаДетальныеЗаписи.ВремяОкончанияРабот));
		ЭлементКалендаря = Календарь.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		ЭлементКалендаря.Значение = ВыборкаДетальныеЗаписи.Ссылка;
		ЭлементКалендаря.Текст = СтрШаблон("Клиент: %1", ВыборкаДетальныеЗаписи.Клиент);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
