
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();

	ЧислоСекундВСутках = 86400;
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		
		Набор.Отбор.Сотрудник.Установить(Отпуск.Сотрудник);
	
		Набор.Прочитать();
		Дат = Отпуск.ДатаНачала;
		
		Для к = 0 По Набор.Количество() - 1 Цикл

			Запись = Набор[к];
			Если Запись.Дата < Отпуск.ДатаНачала Тогда
				Продолжить;
			ИначеЕсли Запись.Дата = Дат Тогда
				Запись.ОтпускПлан = 1;
				Запись.ОтпускФакт = 0;
				Дат = Дат + ЧислоСекундВСутках;
			Иначе
				Пока Дат < Мин(Запись.Дата, Отпуск.ДатаОкончания) Цикл
					НоваяЗапись = Набор.Добавить();
					
					НоваяЗапись.Сотрудник = Отпуск.Сотрудник;
					НоваяЗапись.Дата = Дат;
					НоваяЗапись.ОтпускПлан = 1;
					НоваяЗапись.ОтпускФакт = 0;
					Дат = Дат + ЧислоСекундВСутках;
				КонецЦикла;
				Если Запись.Дата > Отпуск.ДатаОкончания Тогда
					Прервать;
				Иначе
					Запись.ОтпускПлан = 1;
					Запись.ОтпускФакт = 0;
				КонецЕсли;
				Дат = Дат + ЧислоСекундВСутках;
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();

		Пока Дат <= Отпуск.ДатаОкончания Цикл
			Запись = Набор.Добавить();
			Запись.Сотрудник = Отпуск.Сотрудник;
			Запись.Дата = Дат;
			Запись.ОтпускПлан = 1;
			Запись.ОтпускФакт = 0;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЦикла;
		Набор.Записать();

	КонецЦикла;
КонецПроцедуры
