#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПраздничныйДеньПриИзменении(Элемент)
	ДобавитьНерабочийДень();
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("В график работы добавлен нерабочий день: %1", Формат(ПраздничныйДень, "ДЛФ=DD;")));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку();
	ОбщегоНазначенияКлиент.СообщитьПользователю ("Обработка завершена!");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНерабочийДень()

	Запись = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьМенеджерЗаписи();
	Запись.Дата = ПраздничныйДень;
	Запись.ГрафикРаботы = Объект.ГрафикРаботы;
	Запись.Значение = 0;
	Запись.Записать(); 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработку()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
    ОбработкаОбъект.ЗаполнитьГрафик(Объект.ВыборПериода.ДатаНачала, Объект.ВыборПериода.ДатаОкончания, Объект.ВыходныеДни, Объект.ГрафикРаботы );

КонецПроцедуры 

#КонецОбласти
