#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	СформироватьДвижения();
	СформироватьДвиженияОтпуск();
	РассчитатьОсновныеНачисления();
	РассчитатьОтпуск();
	РассчитатьУдержания();
	РассчитатьДолгПередСотрудниками();
	ЗаполнитьФактическийОтпуск();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачислено Из Начислено Цикл

		Если ТекСтрокаНачислено.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОсновныеНачисления Тогда
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачислено.ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ТекСтрокаНачислено.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаНачислено.ДатаОкончания;
			Движение.Сотрудник = ТекСтрокаНачислено.Сотрудник;
			Движение.Оклад = ТекСтрокаНачислено.Оклад;
			Движение.ГрафикРаботы = ТекСтрокаНачислено.ГрафикРаботы;
			Движение.ПроцентОтРабот = ТекСтрокаНачислено.ПроцентОтРабот;
			Движение.ГрафикРаботы = ТекСтрокаНачислено.ГрафикРаботы;
			
		Иначе
			Продолжить;

		КонецЕсли;
		
		
	КонецЦикла;


	
КонецПроцедуры

Процедура РассчитатьОсновныеНачисления()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|	И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОсновныеНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.Результат = Движение.Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План + Движение.ПроцентОтРабот;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина  );
	
КонецПроцедуры

Процедура СформироватьДвиженияОтпуск()
	
	Для Каждого ТекСтрокаНачислено Из Начислено Цикл

		Если ТекСтрокаНачислено.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ТекСтрокаНачислено.ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ТекСтрокаНачислено.ДатаНачала;
			Движение.ПериодДействияКонец = ТекСтрокаНачислено.ДатаОкончания;
			Движение.Сотрудник = ТекСтрокаНачислено.Сотрудник;
			Движение.ГрафикРаботы = ТекСтрокаНачислено.ГрафикРаботы;
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаНачислено.ДатаНачала, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаНачислено.ДатаОкончания, -1));
		
		Иначе
			Продолжить;

		КонецЕсли;
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать( , , Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпуск() 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияНачало, СЕКУНДА, -1), ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияКонец, ДЕНЬ) КАК ДнейОтпуска,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеБазовыйПериод, 0) КАК База
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
		|			Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
		|			Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		
		Если ВыборкаДетальныеЗаписи.ДнейОтпуска = 0 Тогда
			Движение.Результат = 0;
			Продолжить;
		КонецЕсли;
			
		Движение.Результат = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп) * ВыборкаДетальныеЗаписи.ДнейОтпуска / ВыборкаДетальныеЗаписи.База;	
			
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьУдержания()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_ОсновныеНачисления.Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = Окр(ВыборкаДетальныеЗаписи.Результат * 13 / 100);
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьДолгПередСотрудниками()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК ОсновныеНачисления
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_Удержания.Результат) КАК Результат
		|ПОМЕСТИТЬ Удержания
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ОсновныеНачисления - Удержания.Результат КАК Итог
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Удержания КАК Удержания
		|		ПО Начисления.Сотрудник = Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Итог;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьФактическийОтпуск()
	
	ЧислоСекундВСутках = 86400;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыНачислено.Сотрудник,
		|	ВКМ_НачислениеЗарплатыНачислено.ДатаНачала,
		|	ВКМ_НачислениеЗарплатыНачислено.ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начислено КАК ВКМ_НачислениеЗарплатыНачислено
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачислено.ВидРасчета = &Отпуск
		|	И ВКМ_НачислениеЗарплатыНачислено.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дат = НачалоДня(ВыборкаДетальныеЗаписи.ДатаНачала);
		Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();
		Набор.Отбор.Сотрудник.Установить(ВыборкаДетальныеЗаписи.Сотрудник);
		Пока Дат <= ВыборкаДетальныеЗаписи.ДатаОкончания Цикл
			Набор.Отбор.Дата.Установить(Дат);
			Набор.Прочитать();
			Если Набор.Количество() = 0 Тогда
				ДобавитьОтпускВнеПлана(ВыборкаДетальныеЗаписи.Сотрудник, Дат);
			Иначе 
				Для Каждого Запись Из Набор Цикл
					Если Запись.Дата = Дат Тогда
						Запись.ОтпускФакт = 1;
					КонецЕсли;		
				КонецЦикла;	
			Набор.Записать();
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ДобавитьОтпускВнеПлана(Сотрудник, ДатаОтпуска);			
	
	Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Запись = Набор[0];
	Запись.Сотрудник = Сотрудник;
	Запись.Дата = ДатаОтпуска;
	Запись.ОтпускФакт = 1;
	Запись.ОтпускПлан = 0;
	Набор.Записать();
	
КонецПроцедуры	

#КонецОбласти