//__Изменение элементов формы для абоненсткой платы
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ДобавитьРеквизитыНаФорму();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ДобавитьРеквизитыНаФорму();
	Иначе
		УдалитьЭлементыСФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()
	
	ГруппаДействиеДоговора = Элементы.Добавить("ГруппаДействиеДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаДействиеДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДействиеДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДействиеДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаДействиеДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементНачалоДействияДоговора = Элементы.Вставить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"), ГруппаДействиеДоговора, );
	ЭлементНачалоДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементНачалоДействияДоговора.Заголовок = "Начало действия договора";
	ЭлементНачалоДействияДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";	
	
	ЭлементОкончаниеДействияДоговора = Элементы.Вставить("ВКМ_ОкончаниеДействияДоговора",Тип ("ПолеФормы"), ГруппаДействиеДоговора, );
	ЭлементОкончаниеДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементОкончаниеДействияДоговора.Заголовок = "Окончание действия договора";
	ЭлементОкончаниеДействияДоговора.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	
	ГруппаОплата = Элементы.Добавить("ГруппаОплата", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаОплата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОплата.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОплата.ОтображатьЗаголовок = Ложь;
	ГруппаОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементСуммаАбоненсткойПлаты = Элементы.Вставить("ВКМ_СуммаАбоненсткойПлаты", Тип ("ПолеФормы"), ГруппаОплата, );
	ЭлементСуммаАбоненсткойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбоненсткойПлаты.Заголовок = "Сумма абоненсткой платы";
	ЭлементСуммаАбоненсткойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбоненсткойПлаты";
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип ("ПолеФормы"), ГруппаОплата, );
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
КонецПроцедуры
	
&НаСервере
Процедура УдалитьЭлементыСФормы()
	
	ЭлементНачалоДействияДоговора = Элементы.Найти("ВКМ_НачалоДействияДоговора");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;
		
	ЭлементНачалоДействияДоговора = Элементы.Найти("ВКМ_ОкончаниеДействияДоговора");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;
			
	ЭлементНачалоДействияДоговора = Элементы.Найти("ВКМ_СуммаАбоненсткойПлаты");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;
			
	ЭлементНачалоДействияДоговора = Элементы.Найти("ВКМ_СтоимостьЧасаРаботы");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;	
		
	ЭлементНачалоДействияДоговора = Элементы.Найти("ГруппаДействиеДоговора");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;	
		
	ЭлементНачалоДействияДоговора = Элементы.Найти("ГруппаОплата");
	Если ЭлементНачалоДействияДоговора <> Неопределено Тогда
		Элементы.Удалить(ЭлементНачалоДействияДоговора);
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти
//__Изменение элементов формы для абоненсткой платы





