#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Объект.СписокДоговоров.Очистить();
	ДлительнаяОперация = СоздатьРеализацииНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОЗавершении, ПараметрыОжидания);
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СоздатьРеализацииНаСервере()
	
	ДоговорРеализация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Обработки.ВКМ_МассовоеСозданиеАктов.ДоговорРеализацияДлительныеОперации", Объект.Период, Пользователи.ТекущийПользователь());
	
	Возврат ДоговорРеализация;
	
КонецФункции




&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныепПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда

		ДоговорРеализация = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Для Каждого Договор Из ДоговорРеализация Цикл
			НовыйДоговор = Объект.СписокДоговоров.Добавить();
			НовыйДоговор.Договор = Договор.Ключ;
			НовыйДоговор.РеализацияПоДоговору = Договор.Значение;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры	


&НаКлиенте
Процедура ОповещениеОПрогрессе(Результат, ДополнительныепПараметры) Экспорт

	Если Результат.Прогресс <> Неопределено Тогда

		Состояние("Создаются реализации за указанный период", Результат.Прогресс.Процент)
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
