
#Область ОбработчикиСобытийЭлементовТаблицыФормыНачислено
&НаКлиенте
Процедура НачисленоСотрудникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начислено.ТекущиеДанные;

	ОкладПроцент = ПолучитьОкладПроцентНаСервере(ТекущиеДанные.Сотрудник);
	Если ОкладПроцент.Оклад <> Неопределено Тогда
		ТекущиеДанные.Оклад = ОкладПроцент.Оклад;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Сотруднику %1 не установлен оклад",
			ТекущиеДанные.Сотрудник));
	КонецЕсли;

	ТекущиеДанные.ПроцентОтРабот = ОкладПроцент.Процент;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОкладПроцентНаСервере(Сотрудник)
	
	ОкладПроцент = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОкладПроцент.Вставить("Оклад",ВыборкаДетальныеЗаписи.Оклад);
	Иначе
		ОкладПроцент.Вставить("Оклад", Неопределено);	
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
		|		ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|ГДЕ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОкладПроцент.Вставить("Процент",ВыборкаДетальныеЗаписи.СуммаКОплатеОборот);
	Иначе
		ОкладПроцент.Вставить("Процент",0);
	КонецЕсли;
	
	
	Возврат ОкладПроцент;
		
КонецФункции
#КонецОбласти
